ungroup -all -flatten
change_names -hierarchy -rules verilog
write_sdf ../netlist/myfir_unfolded.sdf
write -f verilog -hierarchy -output ../netlist/myfir_unfolded.v
write_sdc ../netlist/myfir_unfolded.sdc

